# Задача 4: Поиск уникальных элементов в списке.
# Напишите программу, которая создает новый список, содержащий только уникальные элементы из исходного списка.


sourceList = [1, 1, 2, 3, 4, 4, 4, 5, 6, 7, 7]
newList = set(sourceList)
print(newList)
