# Декларативное программирование:
# Задача 3: Вычисление факториала числа.
# Напишите программу, которая находит факториал заданного числа N
# с использованием рекурсии или встроенных функций.


import math
print(math.factorial(5))
